{
    "name": "Comece Aqui",
    "definition": "Este é o seu guia interativo para aprender a usar todas as ferramentas incríveis que preparamos para você. Clique nos próximos nós para explorar e se tornar um mestre dos mapas mentais!",
    "children": [
        {
            "name": "Explorando seu Mapa Mental",
            "definition": "Navegar pelas suas ideias é o primeiro passo. Veja como é fácil visualizar e se mover pelo seu mapa.",
            "children": [
                {
                    "name": "Dando Zoom (Aproximar/Afastar)",
                    "definition": "Use a rodinha do mouse ou o gesto de pinça no seu celular para ver seu mapa mais de perto ou ter uma visão geral de longe.",
                    "children": []
                },
                {
                    "name": "Movendo o Mapa (Arrastar)",
                    "definition": "Clique em uma área vazia e arraste com o mouse para mover o mapa inteiro. Assim, você pode explorar todos os cantos das suas ideias.",
                    "children": []
                },
                {
                    "name": "Focando em Ideias (Setas)",
                    "definition": "Use os botões de seta para a esquerda e para a direita para pular de uma ideia para a outra, focando no que é importante no momento.",
                    "children": []
                }
            ]
        },
        {
            "name": "Criando e Editando suas Ideias",
            "definition": "Aprenda a adicionar, modificar e organizar os blocos de informação (que chamamos de 'nós') do seu mapa.",
            "children": [
                {
                    "name": "Editar uma Ideia",
                    "definition": "Para alterar o texto de uma ideia, basta clicar sobre ela. Uma janela de edição se abrirá para você escrever.",
                    "children": []
                },
                {
                    "name": "Salvar suas Alterações",
                    "definition": "Após editar, clique no botão 'Salvar' na janela de edição para que suas mudanças não sejam perdidas.",
                    "children": []
                },
                {
                    "name": "Adicionar uma Nova Ideia",
                    "definition": "Dentro da janela de edição, clique em 'Adicionar Filho' para criar uma nova ideia conectada à atual. É assim que seu mapa cresce!",
                    "children": []
                },
                {
                    "name": "Organizar e Mover Ideias",
                    "definition": "Clique no círculo cinza ao lado de uma ideia e arraste-a para onde quiser. Todas as ideias conectadas a ela se moverão juntas.",
                    "children": []
                },
                {
                    "name": "Excluir uma Ideia",
                    "definition": "Na janela de edição, o botão 'Excluir Nó' apaga a ideia. Cuidado, pois tudo que estiver conectado a ela também será removido!",
                    "children": []
                }
            ]
        },
        {
            "name": "Use a Magia da Inteligência Artificial!",
            "definition": "Não sabe por onde começar? Deixe que nosso assistente de IA crie um mapa mental para você a partir de qualquer texto ou link.",
            "children": [
                {
                    "name": "Ir para a página da IA",
                    "definition": "No menu principal, encontre a opção que te leva para a página de 'Criação com IA'.",
                    "children": []
                },
                {
                    "name": "Inserir o Conteúdo",
                    "definition": "Na página da IA, você pode colar um texto inteiro ou simplesmente colocar o link de um site que você quer resumir.",
                    "children": []
                },
                {
                    "name": "Processar",
                    "definition": "Com o texto ou link no lugar, clique no botão 'Processar'. A IA vai ler tudo e organizar as informações para você. Isso pode levar alguns segundos.",
                    "children": []
                },
                {
                    "name": "Criar seu Mapa!",
                    "definition": "Após a análise, o botão 'Criar Mapa Mental' aparecerá. Clique nele e seu novo mapa, já estruturado, será exibido na tela principal!",
                    "children": []
                }
            ]
        },
        {
            "name": "Salvando e Compartilhando",
            "definition": "Veja como guardar seu trabalho e mostrá-lo para outras pessoas em diferentes formatos.",
            "children": [
                {
                    "name": "Salvar seu Projeto",
                    "definition": "Use o botão 'Salvar Mapa' no menu para baixar um arquivo do seu projeto. Assim, você pode continuar trabalhando nele mais tarde.",
                    "children": []
                },
                {
                    "name": "Carregar um Projeto Salvo",
                    "definition": "Use o botão 'Importar Mapa' no menu para abrir um arquivo de mapa que você salvou anteriormente no seu computador.",
                    "children": []
                },
                {
                    "name": "Exportar para PDF",
                    "definition": "Quer imprimir ou enviar uma foto do seu mapa? Use o botão 'Exportar PDF' no menu para criar um arquivo PDF, fácil de compartilhar.",
                    "children": []
                },
                {
                    "name": "Criar um Relatório de Texto",
                    "definition": "O botão 'Criar Relatório' transforma seu mapa visual em um documento de texto organizado, ótimo para estudos ou apresentações.",
                    "children": []
                }
            ]
        },
        {
            "name": "Outras Ferramentas Úteis",
            "definition": "Conheça outras opções do menu que podem facilitar seu trabalho e personalizar sua experiência.",
            "children": [
                {
                    "name": "Começar um Mapa do Zero",
                    "definition": "O botão 'Novo Mapa' limpa a tela e te dá uma folha em branco para começar um novo projeto quando quiser.",
                    "children": []
                },
                {
                    "name": "Reorganizar a Bagunça",
                    "definition": "Seu mapa ficou desorganizado? O botão 'Recalcular Mapa' arruma tudo automaticamente, voltando ao layout padrão.",
                    "children": []
                },
                {
                    "name": "Mudar as Cores (Tema)",
                    "definition": "Prefere um visual mais escuro para trabalhar? O botão 'Alternar Tema' muda as cores da aplicação para o seu conforto visual.",
                    "children": []
                },
                {
                    "name": "Ver este Manual de Ajuda",
                    "definition": "Perdido? O botão 'Manual' abre este guia de ajuda a qualquer momento para você consultar.",
                    "children": []
                }
            ]
        }
    ]
}