{
    "name": "Manual do Mapa Mental",
    "definition": "Este documento lista as funcionalidades da aplicação de mapa mental, cobrindo navegação, edição de nós, uso da IA e o menu de ações, com base nos arquivos da aplicação.",
    "children": [
        {
            "name": "Navegação e Edição",
            "definition": "Ações de interação e modificação de nós.",
            "children": [
                {
                    "name": "Controles de Visualização",
                    "definition": "Navegação e organização do mapa.",
                    "children": [
                        {
                            "name": "Zoom",
                            "definition": "Controlado pela roda do mouse ou pelo movimento de 'pinça' em telas de toque.",
                            "children": []
                        },
                        {
                            "name": "Mover (Pan)",
                            "definition": "Controlado pelo clique e arrasto em áreas vazias da tela com o mouse ou um dedo em telas de toque.",
                            "children": []
                        },
                        {
                            "name": "Arrastar Nós",
                            "definition": "O nó e todos os seus filhos podem ser arrastados ao clicar e mover o círculo cinza ao lado do nó. As posições são salvas automaticamente.",
                            "children": []
                        }
                    ]
                },
                {
                    "name": "Pop-up de Edição",
                    "definition": "Janela de detalhes e edição de nós.",
                    "children": [
                        {
                            "name": "Abertura",
                            "definition": "Abre ao clicar em qualquer nó, exibindo seu 'Nome' e 'Explicação'.",
                            "children": []
                        },
                        {
                            "name": "Edição",
                            "definition": "Permite editar o 'Nome' e a 'Explicação' do nó através de um ícone de lápis. As mudanças são salvas ao clicar em 'Salvar'.",
                            "children": []
                        },
                        {
                            "name": "Estrutura",
                            "definition": "É possível adicionar um novo nó filho ou excluir o nó atual e seus filhos. O nó principal não pode ser excluído.",
                            "children": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "Inteligência Artificial (IA)",
            "definition": "Ferramentas que usam o modelo 'gemini-1.5-flash-latest' da Google para gerar conteúdo.",
            "children": [
                {
                    "name": "Criação de Mapa com IA",
                    "definition": "A partir de uma chave de API, um texto ou uma URL, a IA analisa o conteúdo e gera um mapa mental hierárquico em formato JSON. O prompt da IA exige nomes de nós com no máximo 35 caracteres, definições completas e todo o texto em português do Brasil. A busca de conteúdo via URL utiliza um proxy para contornar problemas de CORS e extrai apenas o texto principal da página.",
                    "children": []
                },
                {
                    "name": "Expansão com IA",
                    "definition": "É possível adicionar nós filhos a partir de um nó secundário. A IA analisa o conteúdo do nó pai e sugere automaticamente novos nós filhos.",
                    "children": []
                },
                {
                    "name": "Gerenciamento da Chave de API",
                    "definition": "A chave de API é inserida em uma página dedicada, é salva no 'localStorage' do navegador e pode ser colada a partir da área de transferência.",
                    "children": []
                }
            ]
        },
        {
            "name": "Menu de Ações",
            "definition": "Opções de gerenciamento do mapa mental. O menu abre com um clique e fecha ao clicar fora ou em um item da lista.",
            "children": [
                {
                    "name": "Importar Mapa",
                    "definition": "Carrega um arquivo JSON do computador do usuário, valida a presença da propriedade 'name' e salva o conteúdo no 'localStorage' para renderização.",
                    "children": []
                },
                {
                    "name": "Salvar Mapa",
                    "definition": "Exporta o mapa atual como um arquivo 'mindmap_data.json'. Os dados são recuperados do 'localStorage' do navegador e convertidos para uma string JSON formatada com 2 espaços de indentação.",
                    "children": []
                },
                {
                    "name": "Exportar PDF",
                    "definition": "Cria um documento PDF do mapa usando a biblioteca `jsPDF`. A exportação é feita em formato A4 (paisagem) e as cores dos links são suavizadas para uma melhor visualização.",
                    "children": []
                },
                {
                    "name": "Criar Relatório (Markdown)",
                    "definition": "Transforma o mapa em um texto estruturado em Markdown, usando a biblioteca `marked.js` para renderização. A página de relatório também oferece opções para alternar o tema e exportar para PDF.",
                    "children": []
                },
                {
                    "name": "Recalcular Mapa",
                    "definition": "Organiza automaticamente todos os nós do mapa, desconsiderando as posições arrastadas manualmente.",
                    "children": []
                },
                {
                    "name": "Novo Mapa",
                    "definition": "Inicia um mapa mental vazio, carregando uma estrutura padrão sem dados anteriores.",
                    "children": []
                },
                {
                    "name": "Manual",
                    "definition": "Recarrega o mapa mental de instruções padrão a partir do arquivo 'mindmap.json'.",
                    "children": []
                },
                {
                    "name": "Alternar Tema",
                    "definition": "Muda o esquema de cores da aplicação entre o tema claro (`lightTheme`) e o tema escuro (`darkTheme`), conforme definido no arquivo `theme.js`.",
                    "children": []
                }
            ]
        }
    ]
}